session1/cours/introduction_tests.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<!-- 2019-10-06 Sun 19:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introduction aux tests</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Bernard Hugueney" />
</head>
<body>
<div id="content">
<h1 class="title">Introduction aux tests</h1>
<div id="table-of-contents">
<h2>Table des matières</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcbef3c6">1. Pourquoi tester ?</a></li>
<li><a href="#org95b3179">2. Que tester ?</a></li>
<li><a href="#org7090d5d">3. Comment tester ?</a></li>
<li><a href="#org0971926">4. <span class="todo TODO">TODO</span> Outils pour tester</a>
<ul>
<li><a href="#orgc8ca851">4.1. Automatisation</a></li>
<li><a href="#orgd07569f">4.2. Frameworks de test</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgcbef3c6" class="outline-2">
<h2 id="orgcbef3c6"><span class="section-number-2">1</span> Pourquoi tester ?</h2>
<div class="outline-text-2" id="text-1">
<p>
Quand on écrit un programme, on voudrait avoir des raisons de croire
qu'il est correct ! Malheureusement, la plupart des langages de
programmation ne peuvent même pas garantir que (x + 1) &gt; x, à cause
des <a href="https://fr.wikipedia.org/wiki/D%C3%A9passement_d%27entier">dépassements de capacité</a>, ou que 3*(1/10) = 3/10, à cause des
<a href="https://fr.wikipedia.org/wiki/IEEE_754">erreurs de représentation</a> :
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">BadMathDemo</span> {
    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">main</span>(<span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">args</span>){
        <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = <span style="color: #D0372D;">Integer</span>.MAX_VALUE;
        System.out.println(<span style="color: #008000;">"i+1 &gt; i ? "</span> + ((i+1) &gt; i));
        System.out.println(<span style="color: #008000;">"3*(1./10) == 3./10 ? "</span> + ((3*(1./10)) == (3./10)));
    }
}
</pre>
</div>
<p>
i+1 &gt; i ? false
3*(1./10) == 3./10 ? false
</p>

<p>
 Donc évidemment, on ne peut pas prouver grand chose quand à
l'exactitude d'un programme écrit dans un tel langage <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>. Faute de preuves, on
cherche à se donner des raisons de croire qu'un programme fonctionne
correctement en le testant. Mais si des tests peuvent prouver la
présence de bugs, ils ne peuvent pas prouver leur absence. En
pratique, on considère qu'un programme est suffisamment peu buggé
lorsque la vitesse de découverte de bugs et leur gravité sont
suffisamment faibles.
</p>
</div>
</div>


<div id="outline-container-org95b3179" class="outline-2">
<h2 id="org95b3179"><span class="section-number-2">2</span> Que tester ?</h2>
<div class="outline-text-2" id="text-2">
<p>
Si à terme il faudra bien tester le programme, voire le système auquel
s'intègre le programme, on commence par tester les unités
fonctionnelles les plus petites. On s'intéressera dans un premier
temps aux <a href="https://fr.wikipedia.org/wiki/Test_unitaire">tests unitaires</a>. On va tester les fonctions/méthodes et les
classes.
</p>

<p>
Pour qu'une fonction soit plus facilement testable, on voudra qu'elle
soit <a href="https://fr.wikipedia.org/wiki/Fonction_pure">pure</a> autant que possible :
</p>
<ul class="org-ul">
<li>il est plus facile de passer des arguments que de construire un état du système</li>
<li>il est plus facile de valider un résultat calculé que de constater
un effet produit</li>
</ul>

<p>
On voudra tester toutes les lignes du code à tester, ce qui n'est pas
évident à cause des structures de contrôle, d'où la notion de
<a href="https://fr.wikipedia.org/wiki/Couverture_de_code">couverture de code</a> qui caractérise le pourcentage de code qui est
effectivement exécuté par les tests.
</p>
</div>
</div>


<div id="outline-container-org7090d5d" class="outline-2">
<h2 id="org7090d5d"><span class="section-number-2">3</span> Comment tester ?</h2>
<div class="outline-text-2" id="text-3">
<p>
Pour essayer de s'assurer qu'on <a href="https://fr.wikipedia.org/wiki/Test_de_r%C3%A9gression">introduit pas de bugs</a>, on a besoin de
répéter les tests à chaque modification. Par ailleurs, on veut pouvoir
tester différentes configurations (de systèmes d'exploitations, de
versions de logiciels,…). Il est donc essentiel de pouvoir
<b>automatiser</b> les tests. Les tests doivent donc être des programmes
qui peuvent être lancés automatiquement, par exemple à chaque commit,
voire compilation.
</p>

<p>
Pour chaque fonction à tester, on va déterminer un ensemble de valeurs
d'arguments pour lesquels on va s'assurer que la fonction retourne
bien le résultat attendu. On choisit ces arguments de façon à essayer
de tester les cas particuliers et maximiser la couverture de code.
</p>



<dl class="org-dl">
<dt>Exercice</dt><dd>Écrire un ou des programmes de tests qui teste[nt]
chacune des fonctions implémentées.</dd>
</dl>
</div>
</div>


<div id="outline-container-org0971926" class="outline-2">
<h2 id="org0971926"><span class="section-number-2">4</span> <span class="todo TODO">TODO</span> Outils pour tester</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgc8ca851" class="outline-3">
<h3 id="orgc8ca851"><span class="section-number-3">4.1</span> Automatisation</h3>
<div class="outline-text-3" id="text-4-1">
<p>
À terme, on pourra utilisera des outils d'<a href="https://fr.wikipedia.org/wiki/Int%C3%A9gration_continue">Intégration Continue</a>, par
exemple <a href="https://github.com/bhugueney/testing-actions-for-java-tests/commit/0660a23706633c491830459b48a1f11a5d77f3cd/checks?check_suite_id=221096623">Github Actions</a> pour automatiser l'exécution des tests.
</p>
</div>
</div>

<div id="outline-container-orgd07569f" class="outline-3">
<h3 id="orgd07569f"><span class="section-number-3">4.2</span> Frameworks de test</h3>
<div class="outline-text-3" id="text-4-2">
<p>
On utilisera des frameworks de tests, par exemple <a href="http://www.jmdoudoux.fr/java/dej/chap-junit5.htm">JUnit 5</a>, pour
automatiser l'écriture des tests.
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Notes de bas de page: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">d'autres
langages (par exemple <a href="https://fr.wikipedia.org/wiki/Coq_(logiciel)">Coq</a>) sont prévus pour ça</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Auteur: Bernard Hugueney</p>
<p class="date">Created: 2019-10-06 Sun 19:39</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
